#+ плюс
#- минус
#/ слэш
#* звездочка
#% процент
#< меньше
#> больше
#<= меньше или равно
#>= больше или равно

print("я подсчитаю свою живность:") #выводит на экран сообщение

print("Куры", 25 + 30 / 6) #Выводит на экран сообещение и делает вычисления
print("Петухи", 100 - 25 *3 % 4)  #Выводит на экран сообещение и делает вычисления

print("А теперь подсчитаю яйца:")

print(3 + 2 + 1 -5 + 4 % 2 - 1 / 4 + 6)

print("Верно ли, что 3 + 2 < 5 - 7?")

print(3 + 2 < 5 - 7)

print("Сколько будет 3 + 2?", 3 +2)
print("А сколько будет 5 - 7?", 5 - 7)

print("Ой, я, кажется, запутался... Почему False?")

print("Еще раз посчитаю...")

print("Это больше?", 5 >  -2)
print("А это больше или равно?", 5 >= -2)
print("А это меньше иди равно?", 5 <= -2)