types_of_people = 10  #количество типов людей
x = f"Существует {types_of_people} типов людей." #переменная х строковая

bynary = "Python" #переменная 
do_not = "нет" #переменная
y = f"Те, кто понимает {bynary}, и те, кто - {do_not}."  #переменная y

print(x) #вывести на экран переменную х
print(y) #вывести на экран переменную y

print(f"Я сказал: {x}") #вывести на экран текст и переменную х 
print(f"А я еще сказал: '{y}'") #вывести на экран текст и переменную у

hilarious = False #перевод-веселый
joke_evaluation = "Разве это не смешно?! {}" #переменная строковая

#print(joke_evaluation.format(hilarious)) #вывести на экран переменную джоук с форматом бул

w = "Это часть строки слева..." #переменная
e = "а это справа." #переменная

print(w + e) #вывести на экран конкатенацию двух переменных

#вопрос 2 (2.6.11.12)
#вопрос 3 (строка 15 вызывает сомнения)
#потому что это конкатенация строк